import '/F0_BASIC/common_import.dart';

//------------------------------------------------------------------------------
// definition
//------------------------------------------------------------------------------
class GvDef {
  //----------------------------------------------------------------------------
  // version
  //----------------------------------------------------------------------------
  static const int appVersion = 001;

  //----------------------------------------------------------------------------
  // 디자인 기본
  //----------------------------------------------------------------------------
  static const double widthRef = 360;
  static const double heightRef = 800;

  //----------------------------------------------------------------------------
  // 블루투스 종료 대기 시간
  //----------------------------------------------------------------------------
  static const int disconnectWaitTimeAndroid = 5000; //안드로이드는 5초
  static const int disconnectTimeIos = 800; //iOS는 0.8초

  //----------------------------------------------------------------------------
  // Number of audio (중첩 가능한 최대 오디오 인스턴스 수 - 많이 하면 에러 날 수도)
  //----------------------------------------------------------------------------
  static const int audioPlayerNum = 5;

  //----------------------------------------------------------------------------
  // EMG
  //----------------------------------------------------------------------------
  static const int maxDeviceNum = 1;

  //----------------------------------------------------------------------------
  // 그래프
  //----------------------------------------------------------------------------
  static const int lenTimeGraph = 250; // 250 = 10sec

  //----------------------------------------------------------------------------
  // 한계치 설정
  //----------------------------------------------------------------------------
  static const int maxNumOfMuscle = 200; //추가 가능한 근육 숫자 최대 값 (200 설정 예정)
  static const int maxLengthOfMuscleName = 30; //최대 근육 이름

  //----------------------------------------------------------------------------
  // 주파수
  //----------------------------------------------------------------------------
  static const double freqInit = 0; // 시작단계 기본 표시 주파수
  static const double freqDisplayMax = 80; //표시 최대 주파수
  static const double freqDisplayMin = 40; //표시 최소 주파수

  //----------------------------------------------------------------------------
  // 전극접촉품질 (very bad, bad, normal, good, very good)
  //----------------------------------------------------------------------------
  static const List<double> electrodeContactQuality = [1, 1.5, 1.9, 2.3];

  //----------------------------------------------------------------------------
  // 변환
  //----------------------------------------------------------------------------
  static const double convLv = 10; // 전압(mV)를 kgf 로 변환

  //----------------------------------------------------------------------------
  // 성과 표시 가이드
  //----------------------------------------------------------------------------
  static const double aoeFull = 1; // 100% 이상 운동량 달성
  static const double aoeVeryOver = 4; // 400% 이상 운동량 달성
  static const double aoeOver = 2; // 200% 이상 운동량 달성
  static const double aoeGreatH = 1.5; // great 상한
  static const double aoeGreatL = 0.7; // great 하한
  static const double aoeGood = 0.5; // good
  //----------------------------------------------------------------------------
  // 근육 그룹 (상세 근육화 하면서 삭제 처리)
  //----------------------------------------------------------------------------
  // static List<String> muscleTypeList = [
  //   '미선택'.tr,
  //   '팔'.tr,
  //   '어깨'.tr,
  //   '가슴'.tr,
  //   '복부'.tr,
  //   '등'.tr,
  //   '엉덩이'.tr,
  //   '다리'.tr
  // ];
  //----------------------------------------------------------------------------
  // 근육 - 순 우리말
  //----------------------------------------------------------------------------
  static List<String> muscleListKrPure = [
    '사용자'.tr,
    '손목 굽힘근'.tr,
    '손목 폄근'.tr,
    '위팔 두갈래근'.tr,
    '위팔 세갈래근'.tr,
    '앞 어깨세모근'.tr,
    '옆 어깨세모근'.tr,
    '뒤 어깨세모근'.tr,
    '가쪽 어깨돌림근'.tr,
    '안쪽 어깨돌림근'.tr,
    '위 큰가슴근'.tr,
    '중간 큰가슴근'.tr,
    '아래 큰가슴근'.tr,
    '앞 톱니근'.tr,
    '배 곧은근'.tr,
    '배 바깥빗근'.tr,
    '위 등세모근'.tr,
    '중간 등세모근'.tr,
    '아래 등세모근'.tr,
    '넙은 등근'.tr,
    '척추 세움근'.tr,
    '큰 볼기근'.tr,
    '중간 볼기근'.tr,
    '넙다리 네갈래근'.tr,
    '넙다리 뒤근'.tr,
    '모음근'.tr,
    '앞 정강근'.tr,
    '장딴지근'.tr,
  ];
  //----------------------------------------------------------------------------
  // 근육 -한자식
  //----------------------------------------------------------------------------
  static List<String> muscleListKr = [
    '사용자'.tr,
    '손목 굴곡근'.tr,
    '손목 신전근'.tr,
    '이두근'.tr,
    '삼두근'.tr,
    '전면 삼각근'.tr, //5
    '측면 삼각근'.tr,
    '후면 삼각근'.tr,
    '외 회전근'.tr,
    '내 회전근'.tr,
    '상부 대흉근'.tr, //10
    '중부 대흉근'.tr,
    '하부 대흉근'.tr,
    '전거근'.tr,
    '복직근'.tr,
    '외 복사근'.tr, //15
    '상 승모근'.tr,
    '중 승모근'.tr,
    '하 승모근'.tr,
    '광배근'.tr,
    '척추기립근'.tr, //20
    '대둔근'.tr,
    '중둔근'.tr,
    '대퇴사두근'.tr,
    '슬괵근'.tr,
    '내전근'.tr, //25
    '전경골근'.tr,
    '비복근'.tr,
  ];
}

